#### BuiltInFailures.StructuralCustomConnectionFailures Members

---

|  |
| --- |
| BuiltInFailures StructuralCustomConnectionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures StructuralCustomConnectionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | SimpleConnectionTooFarRefs | Simple Structural Connection Handler cannot connect too far elements |
| Public property Static member | StructuralCannotCreateCustomConnection | Could not create a custom connection. |
| Public property Static member | StructuralCustomConnectionComponentsRelationship | Cannot create custom connection due to relationships to external elements. |
| Public property Static member | StructuralCustomConnectionEmpty | Structural Custom Connection cannot be empty. |
| Public property Static member | StructuralCustomConnectionWrongType | Structural Custom Connection has an inappropriate type assigned. |

# See Also

BuiltInFailures StructuralCustomConnectionFailures Class

Autodesk.Revit.DB Namespace